# Parameter Type Id Fabric Param Wires At Cover Property

Source: https://www.revitapidocs.com/2026/167eaaf8-dc43-bf80-8b66-400d198f6c4c.htm

---

| Parameter Type Id Fabric Param Wires At Cover Property |
| --- |

"Wires at Cover": The distribution of wires that is closest to the cover.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId FabricParamWiresAtCover { get; }
```

```
Public Shared ReadOnly Property FabricParamWiresAtCover As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ FabricParamWiresAtCover {
	ForgeTypeId^ get ();
}
```

```
static member FabricParamWiresAtCover : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace